---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.gbXMLExportComplexity.SimpleWithShadingSurfaces
enum: Autodesk.Revit.DB.Analysis.gbXMLExportComplexity
source: html/f1e171a8-a220-13c0-a088-853f43003bb8.htm
---
# Autodesk.Revit.DB.Analysis.gbXMLExportComplexity.SimpleWithShadingSurfaces

Using this enumeration, shading surfaces will be produced from
 room bounding building elements that are not bounding spaces